/**
  ******************************************************************************
  * @file			i2c.h
  * @brief		Заголовочный файл модуля Функций для работы с I2C
	* @author		Алексей Шигенин
  ******************************************************************************
  */

#ifndef I2C_H
#define I2C_H

#include "stm32f10x.h"

void i2cInit(void);											// Инициализация интерфейса I2C
void i2c_start(void);										// Генерация условия START
void i2c_stop(void);										// Генерация условия STOP
void i2c_write(uint8_t); 								// Запись байта данных
void i2c_write_byte(uint8_t, uint8_t);	// Запись байта данных по адресу

#endif	/* I2C_H */
