#include <stdio.h>

int main()
{
    //Целые числа с пробелом в строку: 23, 56, 73, 22
    printf("%d %d %d %d",23, 56, 73, 22);
    printf("\n\n");

    //Целые числа в столбец: 443, 345, 21, 78
    printf("%d\n%d\n%d\n%d",443, 345, 21, 78);
    printf("\n\n");

    //Числа с плавающей точкой в строку: 1.27, 2.71, 3.14, 9.81
    printf("%.2f %.2f %.2f %.2f",1.27, 2.71, 3.14, 9.81);
    printf("\n\n");

    //Числа с плавающей точкой в столбец: 6.62, 1.6, 7.81, 5.68
    printf("%.2f\n%.2f\n%.2f\n%.2f",6.62, 1.6, 7.81, 5.68);
    printf("\n\n");

    //Буквы в строку: S, k, i, l, l
    printf("%c %c %c %c %c",'S', 'k', 'i', 'l', 'l');
    printf("\n\n");

    //Буквы в столбец: B, o, x
    printf("%c\n%c\n%c",'B', 'o', 'x');
    printf("\n");

    return 0;
}
